#pragma once
#include "definitions.h"

void monte_carlo(void)
{
    int arrows = 0;
    // βέλη_κύκλου = 0;
    for (int i = 0; i < 1; i++)
    {
        double x = (rand() % (1 - (-1) + 1)) - 1;
        print("%f\n", x);
    }
    // for (ρίψη = 0; ρίψη < πλήθος_ρίψεων; ρίψη++)
    // {
    //     x = τυχαίος double μεταξύ −1 και 1;
    //     y = τυχαίος double μεταξύ −1 και 1;
    //     τετράγωνο_απόστασης = x * x + y * y;
    //     if (τετράγωνο_απόστασης <= 1)
    //         βέλη_κύκλου++;
    // }
    // εκτίμηση_π = 4 * βέλη_κύκλου / ((double)πλήθος_ρίψεων);
}